"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
"""

season = list('Зима Весна Лето Осень'.split())
# year_monf = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}
# i = int(input('Введите месяц в виде целого числа от 1 до 12. Если хотите закрыть программу введите другое число: '))
# for i in year_monf.keys():
#     print(year_monf.keys())

while True:
    i = int(input('Введите месяц в виде целого числа от 1 до 12. Если хотите закрыть программу введите другое число: '))
    if i == 12 or i == 1 or i == 2:
        print(season[0])
    elif i == 3 or i == 4 or i == 5:
        print(season[1])
    elif i == 6 or i == 7 or i == 8:
        print(season[2])
    elif i == 9 or i == 10 or i == 11:
        print(season[3])
    else:
        print("Некорректно введено число месяца")
        break

